#include "IC_define.h"
///////////////////////////////////////////////////////////
//////ref1_15m_vco2500_A.stp
/////////////////////////////////////////////////////////////
u32 lmk04828_REG_BUFFER_1[lmk04828_REG_BUFFER_SIZE_1]=
{
//		//下述为DA300MHz，AD300MHz的寄存器结果，同时2592时钟输入为100M，out1为150M
//		        0x000090,
//				0x000010,
//				0x000200,
//
//				0x010014,
//				0x010155,
//				0x010300,
//				0x010402,
//				0x010500,
//				0x0106F0,
//				0x010766,
//			 	0x01081E,
//				0x010955,
//				0x010B00,
//				0x010C22,
//				0x010D11,
//				0x010EF0,
//				0x010F16,//66
//				0x01101E,
//				0x011155,
//				0x011300,
//				0x011422,
//				0x011500,
//				0x0116F0,
//				0x011716,
//
//				0x01181E,
//				0x011955,
//				0x011B00,
//				0x011C22,
//				0x011D13,
//				0x011EF0,
//				0x011F16,//66
//
//				0x01201E,
//				0x012155,
//				0x012300,
//				0x012422,
//				0x012500,
//				0x0126F0,
//				0x012716,
//
//				0x01280A,//0x01280C old
//				0x012955,
//				0x012B04,
//				0x012C22,
//				0x012D00,
//				0x012EF0,
//				0x012F66,
//
//				0x01300A,
//				0x013155,
//				0x013300,
//				0x013402,
//				0x013500,
//				0x0136F0,
//				0x013766,
//				0x013825,
//				0x013903,
//				0x013A00,
//
//				0x013B0A, //sysref
//				0x013C00,
//				0x013D08,
//				0x013E03,
//				0x013F04,
//				0x014081,//10
//				0x014100,
//				0x014200,
//				0x014311,
//				0x014400,
//				0x01457F,
//				0x014600,
//				0x01471A,
//				0x014802,
//				0x014942,
//				0x014A02,
//				0x014B16,
//				0x014C00,
//				0x014D00,
//				0x014EC0,
//				0x014F7F,
//				0x015003,
//				0x015102,
//				0x015200,
//				0x015300,
//				0x015478,
//				0x015500,
//				0x015608,
//				0x015700,
//				0x015896,
//				0x015900,
//				0x015A08,
//				0x015BDF,
//				0x015C20,
//				0x015D00,
//				0x015E00,
//				0x015F0B,
//				0x016000,
//				0x016102,
//				0x0162C4,
//				0x016300,
//				0x016400,
//				0x016528,
//				0x017C15,
//				0x017D33,
//				0x016600,
//				0x016700,
//				0x01680A,
//				0x016959,
//				0x016A20,
//				0x016B00,
//				0x016C00,
//				0x016D00,
//				0x016E13,
//				0x017300,
//				0x1FFD00,
//				0x1FFE00,
//				0x1FFF53
//



//		//下述为DA250MHz，AD250MHz的寄存器结果，同时2592时钟输入为100M，out1为125M  对应chengdu_bit程序
				        0x000090,
						0x000010,
						0x000200,

						0x010018,
						0x010155,
						0x010300,
						0x010402,
						0x010500,
						0x0106F0,
						0x010766,
					 	0x01081E,
						0x010955,
						0x010B00,
						0x010C22,
						0x010D11,
						0x010EF0,
						0x010F16,//66
						0x01101E,
						0x011155,
						0x011300,
						0x011422,
						0x011500,
						0x0116F0,
						0x011716,

						0x01181E,
						0x011955,
						0x011B00,
						0x011C22,
						0x011D13,
						0x011EF0,
						0x011F16,//66

						0x01201E,
						0x012155,
						0x012300,
						0x012422,
						0x012500,
						0x0126F0,
						0x012716,

						0x01280C,//0x01280C old
						0x012955,
						0x012B00,
						0x012C22,
						0x012D00,
						0x012EF0,
						0x012F66,

						0x01300C,
						0x013155,
						0x013300,
						0x013402,
						0x013500,
						0x0136F0,
						0x013766,
						0x013825,
						0x013903,
						0x013A00,

						0x013B0C, //sysref
						0x013C00,
						0x013D08,
						0x013E03,
						0x013F04,
						0x014081,//10
						0x014100,
						0x014200,
						0x014311,
						0x014400,
						0x01457F,
						0x014600,
						0x01471A,
						0x014802,
						0x014942,
						0x014A02,
						0x014B16,
						0x014C00,
						0x014D00,
						0x014EC0,
						0x014F7F,
						0x015003,
						0x015102,
						0x015200,
						0x015300,
						0x015478,
						0x015500,
						0x015608,
						0x015700,
						0x015896,
						0x015900,
						0x015A08,
						0x015BDF,
						0x015C20,
						0x015D00,
						0x015E00,
						0x015F0B,
						0x016000,
						0x016102,
						0x0162C4,
						0x016300,
						0x016400,
						0x016528,
						0x017C15,
						0x017D33,
						0x016600,
						0x016700,
						0x01680A,
						0x016959,
						0x016A20,
						0x016B00,
						0x016C00,
						0x016D00,
						0x016E13,
						0x017300,
						0x1FFD00,
						0x1FFE00,
						0x1FFF53
////		//





		//下述为AD100M的2592输出时钟与280MHz参考时钟的寄存器结果，同时2592时钟输入为120M，out1为140M

//				        0x000090,
//						0x000010,
//						0x000200,
//
//						0x010012,
//						0x010155,
//						0x010300,
//						0x010402,
//						0x010500,
//						0x0106F0,
//						0x010766,
//
//					 	0x010818,
//						0x010955,
//						0x010B00,
//						0x010C22,
//						0x010D11,
//						0x010EF0,
//						0x010F16,//66
//
//						0x011018,
//						0x011155,
//						0x011300,
//						0x011422,
//						0x011500,
//						0x0116F0,
//						0x011716,
//
//						0x01181E,
//						0x011955,
//						0x011B00,
//						0x011C22,
//						0x011D13,
//						0x011EF0,
//						0x011F16,//66
//
//						0x01201E,
//						0x012155,
//						0x012300,
//						0x012422,
//						0x012500,
//						0x0126F0,
//						0x012716,
//
//						0x012809,//0x01280C old
//						0x012955,
//						0x012B04,
//						0x012C22,
//						0x012D00,
//						0x012EF0,
//						0x012F66,
//
//						0x013009,
//						0x013155,
//						0x013300,
//						0x013402,
//						0x013500,
//						0x0136F0,
//						0x013766,
//						0x013805,
//						0x013903,
//						0x013A00,
//
//						0x013B09, //sysref
//						0x013C00,
//						0x013D08,
//						0x013E03,
//						0x013F04,
//						0x014081,//10
//						0x014100,
//						0x014200,
//						0x014311,
//						0x014400,
//						0x01457F,
//						0x014600,
//						0x01471A,
//						0x014802,
//						0x014942,
//						0x014A02,
//						0x014B16,
//						0x014C00,
//						0x014D00,
//						0x014EC0,
//						0x014F7F,
//						0x015003,
//						0x015102,
//						0x015200,
//						0x015300,
//						0x015478,
//						0x015500,
//						0x015608,
//						0x015700,
//						0x015896,
//						0x015900,
//						0x015A08,
//						0x015BDF,
//						0x015C20,
//						0x015D00,
//						0x015E00,
//						0x015F0B,
//						0x016000,
//						0x01610A,
//						0x0162C4,
//						0x016300,
//						0x016400,
//						0x016528,
//						0x017C15,
//						0x017D33,
//						0x016600,
//						0x016700,
//						0x01682A,
//						0x016959,
//						0x016A20,
//						0x016B00,
//						0x016C00,
//						0x016D00,
//						0x016E13,
//						0x017300,
//						0x1FFD00,
//						0x1FFE00,
//						0x1FFF53









//
// 下面程序为常规的可调通的2G采样率下的ADC配置程序
//
//		0x000090,    //R0锛圛NIT锛�
//		0x000010,    //R0
//		0x000200,    //R2
//	  //0x000306,    //R3
//	  //0x0004D0,    //R4
//	  //0x00055B,    //R5
//	  //0x000600,    //R5
//	  //0x000C51,    //R12
//	  //0x000D04,    //R13
//
//		//Dout0閮ㄥ垎
//		0x010014,       //   R256  Clock Divider   Dout0
//		0x010155,       //   R257  Digital Delay
//		//0x010255,          R258  User Control鐣岄潰鐨凞ynamic Digital Delay鎺т欢
//		0x010300,       //   R259  绗竴涓� Analog Delay+ Clock Output Select
//		0x010402,       //   R260  Clock Output Select涓殑绗簩涓殑Device Clock + Digital Delay
//		0x010500,       //   R261  绗簩涓殑Analog Delay鐨勬椂闂村拰ADLY_EN鐨�
//		0x0106F0,       //   R262  绗竴涓狝nalog Delay涓� ADLY_PD鍜孉DLYg_PD鐨�
//		0x010766,       //   R263  鎺у埗Clock Output鐨�
//
//		//Dout2-Dout3閮ㄥ垎
//	 	0x01080C,       //   R264  Clock Divider   Dout2   0x01081E
//		0x010955,       //   R265  Digital Delay Dout2
//		//0x010A55,          R266
//		0x010B00,       //   R267  绗竴涓� Analog Delay
//		0x010C02,       //   R268    0x010C22为   Dout3  sysref
//		0x010D11,       //   R269  Dout3鐨凙nalog Delay
//		0x010EF0,       //   R270  Dout2鐨凞DLY_PD
//		0x010F16,       //   R271  66 Dout3鐨凜lock Output 鐨凩VDS涓嶭VPECL20
//
//		//Dout4-Dout5閮ㄥ垎
//		0x01100C,       //   R272   0x01101E
//		0x011155,       //   R273
//	  //0x011255,       //   R274
//		0x011300,       //   R275
//		0x011402,       //   R276  0x011422  sysref
//		0x011500,       //   R277
//		0x0116F0,       //   R278
//		0x011716,       //   R279
//
//		//Dout6-Dout7閮ㄥ垎
//		0x01181E,      //    R280
//		0x011955,      //    R281
//		//0x011A55,    //    R282
//		0x011B00,      //    R283
//		0x011C22,      //    R284
//		0x011D13,      //    R285
//		0x011EF0,      //    R286
//		0x011F16,//66  //    R287
//
//		//Dout8-Dout9閮ㄥ垎
//		0x01201E,     //     R288
//		0x012155,     //     R289
//	    //0x012255,   //     R290
//		0x012300,     //     R291
//		0x012422,     //     R292
//		0x012500,     //     R293
//		0x0126F0,     //     R294
//		0x012716,     //     R295
//
//		//Dout10-Dout11閮ㄥ垎
//		0x01280A,      //    R296
//		0x012955,      //    R297
//		//0x012A55,    //    R298
//		0x012B00,      //    R299
//		0x012C22,      //    R300
//		0x012D00,      //    R301
//		0x012EF0,      //    R302
//		0x012F66,      //    R303
//
//		//Dout12-Dout13閮ㄥ垎
//		0x01300C,      //    R304
//		0x013155,      //    R305
//		//0x013255,    //    R306
//		0x013300,      //    R307
//		0x013402,      //    R308
//		0x013500,      //    R309
//		0x0136F0,      //    R310
//		0x013766,      //    R311
//
//
//		0x013825,     // R312  Current Calculator閮ㄥ垎鐨凮SCout
//		0x013903,     // R313  SYNC/SYSREF妯″潡涓殑 SYSREF Continuous
//		0x013A00,     // R314
//		0x013B0A,     // R315   SYNC/SYSREF妯″潡涓殑  SYSREF Clock Divider 鍙傝�冩椂閽�
//		0x013C00,     // R316
//		0x013D08,     // R317  SYNC/SYSREF妯″潡涓殑Digital Delay涓�8
//		0x013E03,     // R318  SYNC/SYSREF妯″潡涓殑 SYSREF_PULSE_CNT
//
//		0x013F04,     // R319  CLKin and PLLs妯″潡涓殑FB_MUX_EN鎸夐挳
//		0x014081,     // R320  4010 4009
//		0x014100,     // R321  User Control鐣岄潰鐨凞ynamic Digital Delay鐨凟nables
//		0x014200,     // R322  User Control鐣岄潰鐨凞ynamic Digital Delay鐨凟xecute
//		0x014311,     // R323  User Control鐣岄潰鐨凷YSREF&SYNC鐨凷YNC
//		0x014400,     // R324  SYNC_DIS
//		0x01457F,     // R325
//		0x014600,     // R326  CLKin and PLLs妯″潡涓殑Bipolar
//		0x01471A,     // R327  CLKin and PLLs妯″潡涓瑿LKin0鍜孋LKin1鍧囦负PLL1涓擯LL1 Reference 涓篊LKin1 Manual 绗簩涓负CLKin1
//		0x014802,     // R328  CLKin and PLLs妯″潡涓殑 CLkin_SLE0
//		0x014942,     // R329  CLKin and PLLs妯″潡涓殑 CLkin_SLE1
//		0x014A02,     // R330   Others 涓殑Reset/GPO
//		0x014B16,     // R331  User Control鐣岄潰鐨� Holdover鏈�宸︿晶
//		0x014C00,     // R332  User Control鐣岄潰鐨�  Holdover涓殑MAN_DAC涓�512
//		0x014D00,     // R333  User Control鐣岄潰鐨�  Holdover涓殑DAC_TRIP_LOW
//		0x014EC0,     // R334  User Control鐣岄潰鐨�  Holdover涓殑DAC_TRIP_HIGH+DAC_CLK_MULT
//		0x014F7F,     // R335  User Control鐣岄潰鐨�  Holdover涓殑DAC_CLK_CNTR涓�127
//		0x015003,     // R336  User Control鐣岄潰鐨�  Holdover涓殑HOLDOVER_EN涓嶩ITLESS銆傘�傘��
//		0x015102,     // R337
//		0x015200,     // R338   User Control鐣岄潰鐨�  Holdover涓殑HOLDOVER_DLD_CNT涓�512
//		0x015300,     // R339
//		0x015478,     // R340   PLL1 R Dividers绗竴涓负120
//		0x015500,     // R341
//		0x015608,     // R342   PLL1 R Divider 绗簩涓负8
//		0x015700,     // R343
//		0x015896,     // R344   PLL1 R Dividers绗笁涓负150
//		0x015900,     // R345
//		0x015A08,     // R346   CLKin and PLLs妯″潡涓殑 N Divider
//		0x015BDF,     // R347   PLL1 Phase Detector and Charge Pump
//		0x015C20,     // R348
//		0x015D00,     // R349   User Control鐣岄潰鐨凱LL2鐨凱LL1_DLD_CNT
//		0x015E00,     // R350   User Control鐣岄潰鐨凱LL2鐨凱LL1_NDLY涓嶳DLY
//
//	  //Other閮ㄥ垎
//		0x015F0B,     // R351   PLL1 LD
//		0x016000,     // R352
//		0x016102,     // R353   CLKin and PLLs妯″潡涓殑 PLL2 Phase銆傘�傘�傜殑鏁板�间负50
//		0x0162C4,     // R354   CLKin and PLLs妯″潡涓殑N Prescaler涓�6
//		0x016300,     // R355
//		0x016400,     // R356
//		0x016528,     // R357   CLKin and PLLs妯″潡涓殑N Cal Divider(PLL2 0-Delay) 650C
//
////		0x0171AA,     // R369   User Control鐣岄潰鐨� Biasgen xPLL2_R_ibias
////		0x017202,     // R370   User Control鐣岄潰鐨� Biasgen xPLL1_R_ibias
//		0x017C15,     // R380   User Control鐣岄潰鐨凮PT_REG_1
//		0x017D33,     // R381   User Control鐣岄潰鐨凮PT_REG_2
//		0x016600,     // R358   User Control鐣岄潰鐨凱LL2鐨凱LL2_FCAL_DIS
//		0x016700,     // R359
//		0x01680A,     // R360    PLL2鐨凬 Divider
//		0x016959,     // R361   PLL2 3200uA
//		0x016A20,     // R362    Others 涓殑SYNC
//		0x016B00,     // R363     User Control鐣岄潰鐨凱LL2鐨凱LL2_DLD_CNT
//		0x016C00,     // R364    CLKin and PLLs妯″潡涓殑 Internal Loop Filter
//		0x016D00,     // R365
//		0x016E13,     // R366    PLL2 LD   R366
//		0x017300,     // R371    R371  CLKin and PLLs妯″潡涓殑 PLL2_PD
////		0x018200,     // R386    User Control鐣岄潰鐨� Readback
////		0x018300,     // R387    User Control鐣岄潰鐨� Readback
////		0x018400,     // R388    User Control鐣岄潰鐨� Readback
////		0x018500,     // R389    User Control鐣岄潰鐨� Readback
////		0x018800,     // R392    User Control鐣岄潰鐨� Readback
////		0x018900,     // R393
////		0x018A00,     // R394
////		0x018B00,     // R395
//		0x1FFD00,     // R8189  杩欎笁涓负User Control鐣岄潰鐨凷PI Lock鐨�
//		0x1FFE00,     // R8190
//		0x1FFF53      // R8191

};


u32 lmk04828_REG_BUFFER_2[lmk04828_REG_BUFFER_SIZE_2]=
{
		0x013900,
		0x014000

};

u32 lmk04828_REG_BUFFER_3[lmk04828_REG_BUFFER_SIZE_3]=
{
		0x014391,
		0x014311
};

u32 lmk04828_REG_BUFFER_5[lmk04828_REG_BUFFER_SIZE_5]=
{
		0x013901,
		0x0144FF
};

u32 lmk04828_REG_BUFFER_6[lmk04828_REG_BUFFER_SIZE_6]=
{
		0x013901
};

u32 lmk04828_REG_BUFFER_7[lmk04828_REG_BUFFER_SIZE_7]=
{
		0x010F06
};
u32 lmk04828_REG_BUFFER_8[lmk04828_REG_BUFFER_SIZE_8]=
{
		0x010F16,
		0x011F06
};
