#include "IC_define.h"

/////////////////////////////////////////////////////////////
long long int ada16d6000_1_REG_BUFFER_1[ada16d6000_1_REG_BUFFER_SIZE_1]=
{
	       0x0a00100001,
			0x0a00100000,
			0x08000000c1,
			0x0800103200,
			0x08100000c1,
			0x0810103200,
			0x08200000c1,
			0x0820103200,
			0x08300000c1,
			0x0830103200,
			0x08400000c1,
			0x0840103200,
			0x08500000c1,
			0x0850103200,
			0x08600000c1,
			0x0860103200,
			0x08700000c1,
			0x0870103200,
			0x08c0808cf5,
			0x08c0900733,
			0x08c0c01a01,
			0x08c0d00f0a,
			0x08c100232f,
			0x08c1100780,
			0x08c1402415,
			0x08c1500000,
			0x08c1800011,
			0x08c1901800,
			0x08c0400001,
			0x08c0500000,
			0x08e080cf00,
			0x08e0900100




};

long long int ada16d6000_1_REG_BUFFER_2[ada16d6000_1_REG_BUFFER_SIZE_2]=
{
		   0x0c00000003,
	   0x0e00100109,
	   0x0e40100109,
	   0x0a00200044,//4
	   0x0a00300044,
	   0x0a00100030,
	   0x0a00400000

//涓嬭堪鐗堟湰涓篋AC鍙帶鐨勭偣棰戣緭鍑虹粨鏋�
//		0x0c00000000,//閫夋嫨鏁版嵁杈撳叆妯″紡
//		0x0E00100011,//閫夋嫨NCO M1妯″紡 DAC0
//		0x0E40100011,//閫夋嫨NCO M1妯″紡 DAC1
//
//		0x0E00200011,//DAC0 FCTRL [15:0]
//		0x0E00301311,//DAC0 FCTRL [31:16]
//		0x0E00400003,//DAC0 FCTRL [35:32]   //调整频率的
//		0x0E00504db0,//DAC0 NCO AMP
//
//		0x0E40200011,//DAC1 FCTRL [15:0]
//		0x0E40301311,//DAC1 FCTRL [31:16]
//		0x0E40400006,//DAC1 FCTRL [35:32]
//		0x0E40504db0,//DAC1 NCO AMP
//
//		0x0A00400001,//SET NCO
//		0x0A00400000,//SET NCO
//
//		0x0A00100030 //en_DEM锛屽叧闂悶鑴夊啿锛屽叧闂璶co鍚屾


};

long long int ada16d6000_1_REG_BUFFER_3[ada16d6000_1_REG_BUFFER_SIZE_3]=
{
		0x0a00100126,
		0x0a00100026
};
